Documents/УРВ_ПакетРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>УРВ_ПакетРабот</Name>
			<Comment>Пакет работ</Comment>
			<BasedOn>
				<xr:Item>Document.ЗаказНаряд</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Comment>Рабочее место</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.УРВ_СтатусыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеАРМ</Name>
					<Comment>Представление АРМ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПерерыва</Name>
					<Comment>Вид перерыва</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.УРВ_ВидыПерерывов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаНачалаРабот</Name>
					<Comment>Плановая дата начала работ</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаОкончанияРабот</Name>
					<Comment>Плановая дата окончания работ</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
					<Comment>Сотрудники</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Comment>Сотрудник</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтметкаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
					<Comment>Работы</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказНаряд</Name>
							<Comment>Заказ-наряд</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиЗаказНаряда</Name>
							<Comment>Идентификатор строки заказ наряда</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Comment>Работа</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/УРВ_СостояниеРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УРВ_СостояниеРабот</Name>
			<Comment>Состояние работ</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПерерыва</Name>
					<Comment>Вид перерыва</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Comment>Рабочее место (Цех)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПакетРабот</Name>
					<Comment>Пакет работ</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.УРВ_ПакетРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Comment>Заказ наряд</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Comment>Работа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УРВ_ФактическоеВремяРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УРВ_ФактическоеВремяРабот</Name>
			<Comment>Фактическое время работ</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Comment>Время, ч</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Comment>Заказ наряд</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияАвтомобиля</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Comment>Рабочее место (Цех)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Comment>Работа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПакетРабот</Name>
					<Comment>Пакет работ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/УРВ_СтатусыРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>УРВ_СтатусыРабот</Name>
			<Comment>Статусы работ</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланировано</Name>
					<Comment>Запланировано</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнение</Name>
					<Comment>Выполняется</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пауза</Name>
					<Comment>Приостановлено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
					<Comment>Завершено</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УРВ_ПакетРабот/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
Перем Режим;
Перем ДатаЗаписиСостояния;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА



// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Организация",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
	ОбязательныеРеквизиты.Вставить("Автор",1);
	ОбязательныеРеквизиты.Вставить("ХозОперация",1);
	ОбязательныеРеквизиты.Вставить("РабочееМесто",1);
	ОбязательныеРеквизиты.Вставить("Статус",1);
	
	ОбязательныеРаботы=Новый Структура();
	ОбязательныеРаботы.Вставить("Работа",1);
	ОбязательныеРаботы.Вставить("ЗаказНаряд",1);
	ОбязательныеРаботы.Вставить("ИдентификаторСтрокиЗаказНаряда",3);
	ОбязательныеРаботы.Вставить("Количество",1);
	ОбязательныеРаботы.Вставить("Коэффициент",1);
	
	ОбязательныеСотрудники = Новый Структура();
	ОбязательныеСотрудники.Вставить("Сотрудник", 3);
	
	ОбязательныеРеквизиты.Вставить("Работы", ОбязательныеРаботы);
	ОбязательныеРеквизиты.Вставить("Сотрудники", ОбязательныеСотрудники);
	
	Возврат ОбязательныеРеквизиты;
КонецФункции

// Проверяет корректность заполнения объекта.
// Возвращает Истина если все заполнено корректно и Ложь иначе.
// В случае некорректного заполнения формирует строку описанием возникших ошибок "Ошибки"
// На вход может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	// Здесь могут быть определены дополнительные к стандартным обязательным реквизитам условия проверки
	Возврат дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
КонецФункции
 
// Функция проверяет, допустимо ли изменение объекта
// Возвращает Истина, если изменения возможны, ложь иначе
// Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов,
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции

// Возвращает список возможных хозяйственных операций документа
// Возвращаемое значение: СписокЗначений. 
// Строка списка: Значение - имя предопределенного элемента; 
//				  Представление - красивое его представление
// 				  "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("УРВ_ПакетРабот","Пакет работ",Истина);
	Возврат СписокХозОпераций;
КонецФункции

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка – Имя реквизита документа с полным путем (например Товары.Номенклатура).
//  ЭтаФорма	– Форма	 – Ссылка на форму документа. Если значение неопределено,
//                         производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	// ОБРАБОТКА РЕКВИЗИТОВ ОБЪЕКТА
	
	Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
КонецФункции // ОбработкаРеквизита()

// возвращает выборку по шапке
//
// Параметры:
//  ДокументСсылка - Ссылка на документ для которого получаем шапку.
//
// Возвращаемое значение:
//  Выборка - выборка по шапке
//
//Функция ПолучитьШапкуДокумента(ДокументСсылка)
//	Запрос=Новый Запрос("
//	|ВЫБРАТЬ
//	|	Док.Ссылка КАК Ссылка,
//	|	Док.Дата КАК Дата,
//	|	Док.ХозОперация КАК ХозОперация,
//	|	Док.МоментВремени КАК МоментВремени,
//	|	Док.ПодразделениеКомпании КАК ПодразделениеКомпании,
//	/////////// ПРИВАТ ////////////
//	|	Док.РабочееМесто КАК РабочееМесто,
//	|	Док.Статус КАК Статус,
//	|	Док.Перерыва КАК ВидПерерыва
//	|
//	|ИЗ
//	|	Документ."+Метаданные().Имя+" КАК Док
//	|ГДЕ
//	|	Док.Ссылка=&Ссылка
//	|");
//	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
//	Выборка=Запрос.Выполнить().Выбрать(); Выборка.Следующий();
//	
//	Возврат Выборка;
//КонецФункции // ПолучитьШапкуДокумента()
//
#Если Клиент Тогда

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

// Функция осуществляет печать произвольного документа.
// Можно направить печать на экран или принтер, а также распечатать необходимое количество копий.
//
// Параметры:
//	ЭтотОбъект							- ДокументОбъект	- Документ для печати
//	НазваниеПечатнойФормы 				- Строка			- Название печатной формы, если пусто, то по умолчанию
//	КоличествоЭкземпляров				- Число				- Количество экземпляров документа
//	НаПринтер							- Булево			- Признак отправки документа на принтер без отображения его на экране
//  Документ 	  						- ТабличныйДокумент	- Макет печатной формы
//
// Возвращаемое значение:
//   ТабличныйДокумент	- Сформированная печатная форма
//
Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
	Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
КонецФункции // Печать()

// Возвращает доступные варианты печати документа
// Возвращаемое значение: 
//  Структура, каждая строка которой
//  соответствует одному из вариантов печати
//  Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм() Экспорт
	СтруктураМакетов=Новый Структура();
	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСписокПечатныхФорм()

#КонецЕсли
// Если Клиент Тогда - завершена клиентская часть

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Процедура - обработчик ввода на основании
Процедура ОбработкаЗаполнения(Основание, РаботыИзWA=Неопределено) Экспорт
	дкОбработкаЗаполнения(ЭтотОбъект, Основание); 
	
	Если Основание <> Неопределено
		И ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
		
		ЭтотОбъект.Работы.Очистить();
		
		ЭтотОбъект.РабочееМесто = Основание.Цех;
		ЭтотОбъект.Статус = Перечисления.УРВ_СтатусыРабот.Запланировано;
		
		// KRAA
		// Заполним работы
		Если РаботыИзWA=Неопределено Или РаботыИзWA=Истина Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ПакетРаботРаботы.ИдентификаторСтрокиЗаказНаряда
			               |ИЗ
			               |	Документ.УРВ_ПакетРабот.Работы КАК ПакетРаботРаботы
			               |ГДЕ
			               |	ПакетРаботРаботы.Ссылка.ПометкаУдаления = ЛОЖЬ
			               |	И ПакетРаботРаботы.ЗаказНаряд = &ЗаказНаряд";
			Запрос.УстановитьПараметр("ЗаказНаряд", Основание);
			РаботыВЗаказНарядах = Запрос.Выполнить().Выгрузить(); 		
	
			Для Каждого СтрокаРабот Из Основание.Работы Цикл
				Если РаботыВЗаказНарядах.Найти(СтрокаРабот.ИдентификаторРаботы, "ИдентификаторСтрокиЗаказНаряда") = Неопределено Тогда
					НоваяСтрока = ЭтотОбъект.Работы.Добавить();
					НоваяСтрока.ЗаказНаряд = Основание;
					НоваяСтрока.ИдентификаторСтрокиЗаказНаряда = СтрокаРабот.ИдентификаторРаботы;
					НоваяСтрока.Работа = СтрокаРабот.Работа;
					НоваяСтрока.Количество = СтрокаРабот.Количество;
					НоваяСтрока.Коэффициент = СтрокаРабот.Коэффициент;
				Иначе
				КонецЕсли;
			КонецЦикла;
		Иначе			
			Для Каждого СтрокаРабот Из Основание.Работы Цикл
				Если РаботыИзWA.Найти(СокрЛП(СтрокаРабот.Работа.Код)) <> Неопределено Тогда
					НоваяСтрока = ЭтотОбъект.Работы.Добавить();
					НоваяСтрока.ЗаказНаряд = Основание;
					НоваяСтрока.ИдентификаторСтрокиЗаказНаряда = СтрокаРабот.ИдентификаторРаботы;
					НоваяСтрока.Работа = СтрокаРабот.Работа;
					НоваяСтрока.Количество = СтрокаРабот.Количество;
					НоваяСтрока.Коэффициент = СтрокаРабот.Коэффициент;
				Иначе
				КонецЕсли;
			КонецЦикла; 		
		КонецЕсли;
		
		// Заполним исполнителей
		// только по тем работам, которые попали в пакет
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
					   |	ЗаказНарядИсполнители.Исполнитель КАК Сотрудник
					   |ИЗ
					   |	Документ.ЗаказНаряд.Исполнители КАК ЗаказНарядИсполнители
					   |ГДЕ
					   |	ЗаказНарядИсполнители.Ссылка = &ЗаказНаряд
					   |	И ЗаказНарядИсполнители.ИдентификаторРаботы В(&СписокИдентификаторовРабот)";
		Запрос.УстановитьПараметр("ЗаказНаряд", Основание);
		Запрос.УстановитьПараметр("СписокИдентификаторовРабот", ЭтотОбъект.Работы.ВыгрузитьКолонку("ИдентификаторСтрокиЗаказНаряда"));
		ТаблицаИсполнителей = Запрос.Выполнить().Выгрузить();
		Если ТаблицаИсполнителей.Количество() > 0 Тогда
			ЭтотОбъект.Сотрудники.Загрузить(ТаблицаИсполнителей);	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда Возврат; КонецЕсли;
	Если НЕ ОбменДанными.Загрузка Тогда
		
		Если ЭтотОбъект.Дата = Дата(1,1,1,0,0,0) Тогда ЭтотОбъект.Дата = ТекущаяДата(); КонецЕсли;
		ПредставлениеАРМ = Строка(Номер) + " от "+ Формат(Дата, "ДЛФ=Д");
		ПереченьЗаказов = "";
		
		ВремТабл = Работы.Выгрузить();
		ВремТабл.Свернуть("ЗаказНаряд","Количество");
		Для Каждого СтрокаЗаказов Из ВремТабл Цикл
			ПредставлениеЗН = "№" + Строка(СтрокаЗаказов.ЗаказНаряд.Номер) + "," + СтрокаЗаказов.ЗаказНаряд.Автомобиль.Модель + ";";
			ПереченьЗаказов = ПереченьЗаказов + ПредставлениеЗН;
		КонецЦикла;
		ПредставлениеАРМ = ПредставлениеАРМ + " (" + Лев(ПереченьЗаказов, СтрДлина(ПереченьЗаказов)-1) + ")";
		
		ЗаписьВФорме = ДополнительныеСвойства.Свойство("ЗаписьВФорме");
		
		// ЗАПИСЬ
		Если РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
			Если Статус = Перечисления.УРВ_СтатусыРабот.Завершение Тогда
				РежимЗаписи = РежимЗаписиДокумента.Проведение;	
			Иначе
				//#Если Клиент Тогда
					ДатаЗаписиСостояния = ТекущаяДата();
				//#Иначе	
					//ДатаЗаписиСостояния = КонецДня(ТекущаяДата());
				//#КонецЕсли
				Если Статус = Перечисления.УРВ_СтатусыРабот.Выполнение Тогда	
					ВидПерерыва = Справочники.УРВ_ВидыПерерывов.ПустаяСсылка();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// ПРОВЕДЕНИЕ	
		Если  РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			
			Если Статус <> Перечисления.УРВ_СтатусыРабот.Завершение Тогда
				#Если Клиент Тогда
				//Если ЗаписьВФорме Тогда
					Сообщить("Проведение документа допустимо только в состоянии ""Завершено""", СтатусСообщения.Важное);
				//КонецЕсли;
				#КонецЕсли
				Отказ=Истина;
			КонецЕсли;
			ВидПерерыва = Справочники.УРВ_ВидыПерерывов.ПустаяСсылка();
			Если ЗаписьВФорме Тогда
				// если проведение в форме документа, то проверим оперативно или нет
				Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
					//#Если Клиент Тогда
					//	ЭтотОбъект.Дата = РабочаяДата + Час(ТекущаяДата())*60*60 + Минута(ТекущаяДата())*60 + Секунда(ТекущаяДата());
					//#Иначе	
						ЭтотОбъект.Дата = ТекущаяДата();
					////#КонецЕсли
				Иначе
					// если не оперативно, то дату документа не меняем
					// ...но убедимся, что дата документа не меньше последнего из состояний
					ЗаписиРегистра = РегистрыСведений.УРВ_СостояниеРабот.СрезПоследних(, Новый Структура("ПакетРабот", ЭтотОбъект.Ссылка));
					ЗаписиРегистра.Сортировать("Период Убыв");
					Если ЭтотОбъект.Дата < ЗаписиРегистра[0].Период Тогда
						#Если Клиент Тогда
						Сообщить("Документ проводится раньше даты последнего изменения статуса <"+ ЗаписиРегистра[0].Статус + " с " + Строка(ЗаписиРегистра[0].Период) +"> 
						|Установите дату документа, соответствующую дате завершения работ!",СтатусСообщения.Важное);	
						#КонецЕсли
						Отказ = Истина;
					КонецЕсли;
				КонецЕсли;
			Иначе
				// если проведение через АРМ или из списка, то всегда оперативно
				
				Если НЕ ЭтотОбъект.Проведен Тогда
					//#Если Клиент Тогда
					//	ЭтотОбъект.Дата = РабочаяДата + Час(ТекущаяДата())*60*60 + Минута(ТекущаяДата())*60 + Секунда(ТекущаяДата());
					//#Иначе	
						ЭтотОбъект.Дата = ТекущаяДата();
					//#КонецЕсли
				КонецЕсли;
			КонецЕсли;
			ДатаЗаписиСостояния = ЭтотОбъект.Дата;
		КонецЕсли;	
		
		// ОТМЕНА ПРОВЕДЕНИЯ	
		Если  РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			
			Если Статус = Перечисления.УРВ_СтатусыРабот.Завершение Тогда
				Статус = Перечисления.УРВ_СтатусыРабот.Выполнение;		
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	Если ЗаписьВФорме Тогда
		ДополнительныеСвойства.Удалить("ЗаписьВФорме");
	КонецЕсли;
	
	Режим = РежимЗаписи;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	
	Если НЕ ОбменДанными.Загрузка Тогда
		
		// Проверим в каком статусе документ записывался в прошлый раз
		ЗаписиРегистра = РегистрыСведений.УРВ_СостояниеРабот.СрезПоследних(, Новый Структура("ПакетРабот", ЭтотОбъект.Ссылка));
		ЗаписиРегистра.Сортировать("Период Убыв");
		// Если статус изменился, то запишем изменение состояния
		Если ЗаписиРегистра.Количество() = 0 ИЛИ ЗаписиРегистра[0].Статус <> Статус ИЛИ Режим = РежимЗаписиДокумента.Проведение Тогда
			Если Режим = РежимЗаписиДокумента.ОтменаПроведения Тогда
				Попытка
					НаборЗаписей = РегистрыСведений.УРВ_СостояниеРабот.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.ПакетРабот.Значение = ЭтотОбъект.Ссылка;
					НаборЗаписей.Отбор.ПакетРабот.Использование = Истина;
					НаборЗаписей.Отбор.Статус.Значение = Перечисления.УРВ_СтатусыРабот.Завершение;
					НаборЗаписей.Отбор.Статус.Использование = Истина;
					НаборЗаписей.Прочитать();
					НаборЗаписей.Очистить();
					НаборЗаписей.Записать();
				Исключение
					Отказ = Истина;
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
			Иначе	
				Попытка
					НаборЗаписей = РегистрыСведений.УРВ_СостояниеРабот.СоздатьНаборЗаписей();
					Если Режим = РежимЗаписиДокумента.Проведение Тогда
						НаборЗаписей.Отбор.Статус.Значение = Перечисления.УРВ_СтатусыРабот.Завершение;
						НаборЗаписей.Отбор.Статус.Использование = Истина;
					Иначе 
						НаборЗаписей.Отбор.Период.Значение = ДатаЗаписиСостояния;
						НаборЗаписей.Отбор.Период.Использование = Истина;
					КонецЕсли;
					НаборЗаписей.Отбор.ПакетРабот.Значение = ЭтотОбъект.Ссылка;
					НаборЗаписей.Отбор.ПакетРабот.Использование = Истина;
					НаборЗаписей.Прочитать();
					НаборЗаписей.Очистить();
					НаборЗаписей.Записать();
					
					Для Каждого СтрокаСотрудники Из Сотрудники Цикл
						Для Каждого СтрокаРабот ИЗ Работы Цикл
							НоваяЗапись = НаборЗаписей.Добавить();
							НоваяЗапись.Период = ДатаЗаписиСостояния;
							НоваяЗапись.РабочееМесто = ЭтотОбъект.РабочееМесто;
							НоваяЗапись.ПакетРабот = ЭтотОбъект.Ссылка;
							НоваяЗапись.Сотрудник = СтрокаСотрудники.Сотрудник;
							НоваяЗапись.ЗаказНаряд = СтрокаРабот.ЗаказНаряд;
							НоваяЗапись.Работа = СтрокаРабот.Работа;
							НоваяЗапись.Статус = ЭтотОбъект.Статус;
							НоваяЗапись.ВидПерерыва = ВидПерерыва;
						КонецЦикла;
					КонецЦикла;
					НаборЗаписей.Записать(Ложь);
				Исключение
					Отказ = Истина;
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ПометкаУдаления Тогда
		обОтправитьЗапросВWA(Строка(Ссылка.УникальныйИдентификатор()),"3","D");
	КонецЕсли;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	НаборЗаписейФактическоеВремяРабот = РегистрыСведений.УРВ_ФактическоеВремяРабот.СоздатьНаборЗаписей();
	НаборЗаписейФактическоеВремяРабот.Отбор.ПакетРабот.Установить(Ссылка);
	НаборЗаписейФактическоеВремяРабот.Прочитать();
	НаборЗаписейФактическоеВремяРабот.Очистить();
	НаборЗаписейФактическоеВремяРабот.Записать();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Если НЕ дкОбработкаПроведения(ЭтотОбъект, Отказ, Режим) Тогда Возврат; КонецЕсли;
	
	// Определим общее время выполнения пакета работ
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	СостояниеРабот.Период КАК Период,
	               |	СостояниеРабот.РабочееМесто КАК РабочееМесто,
	               |	СостояниеРабот.Сотрудник КАК Сотрудник,
	               |	СостояниеРабот.Статус КАК Статус
	               |ИЗ
	               |	РегистрСведений.УРВ_СостояниеРабот КАК СостояниеРабот
	               |ГДЕ
	               |	СостояниеРабот.ПакетРабот = &ПакетРабот
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СостояниеРабот.Период,
	               |	СостояниеРабот.РабочееМесто,
	               |	СостояниеРабот.Сотрудник,
	               |	СостояниеРабот.Статус
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период
	               |ИТОГИ ПО
	               |	Период,
	               |	Статус";
	Запрос.УстановитьПараметр("ПакетРабот", ЭтотОбъект.Ссылка);
	ЗаписиСостоянийПериод = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	СписокПериодов = Новый СписокЗначений;
	
	СчитатьПромежуточныеИтоги = Ложь;
	СчитатьОкончательныеИтоги = Ложь;
	ПромежуточноеВремяВСекундах = 0;
	ОбщееВремяРаботы = 0;
	
	ДатаНачалаРабот = ПлановаяДатаНачалаРабот;
	ДатаОкончанияРабот = ПлановаяДатаОкончанияРабот;
		
	Пока ЗаписиСостоянийПериод.Следующий() Цикл
		
		ЗаписиСостоянийСтатус = ЗаписиСостоянийПериод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		ЗаписиСостоянийСтатус.Следующий();
		Если ЗаписиСостоянийСтатус.Статус = Перечисления.УРВ_СтатусыРабот.Выполнение Тогда
			ДатаНачалаРабот = ЗаписиСостоянийСтатус.Период;
			СчитатьПромежуточныеИтоги = Ложь;	
			СчитатьОкончательныеИтоги = Ложь;
		ИначеЕсли ЗаписиСостоянийСтатус.Статус = Перечисления.УРВ_СтатусыРабот.Пауза Тогда
			ДатаОкончанияРабот = ЗаписиСостоянийСтатус.Период;
			СчитатьПромежуточныеИтоги = Истина;	
			СчитатьОкончательныеИтоги = Ложь;
		ИначеЕсли ЗаписиСостоянийСтатус.Статус = Перечисления.УРВ_СтатусыРабот.Завершение Тогда
			ДатаОкончанияРабот = ЗаписиСостоянийСтатус.Период;
			СчитатьПромежуточныеИтоги = Истина;	
			СчитатьОкончательныеИтоги = Истина;
		КонецЕсли;
		
		Если СчитатьПромежуточныеИтоги Тогда
			
			// если дата начала не заполнена, то нет возможности рассчитать фактическое время
			Если ДатаНачалаРабот = Дата(1,1,1,0,0,1) Тогда
				ПромежуточноеВремяВСекундах = 0;
			Иначе
				ПромежуточноеВремяВСекундах = ДатаОкончанияРабот - ДатаНачалаРабот;
				
				СтруктураЭлемента = Новый Структура("Время, РабочееМесто, СписокСотрудников");
				СтруктураЭлемента.Вставить("Время", ПромежуточноеВремяВСекундах);
				
				ЗаписиСостоянийСтроки = ЗаписиСостоянийСтатус.Выбрать(ОбходРезультатаЗапроса.Прямой);
				СписокСотрудников = Новый СписокЗначений;
				ТекущееРабочееМесто = Неопределено;
				Пока ЗаписиСостоянийСтроки.Следующий() Цикл
					Если ТекущееРабочееМесто = Неопределено Тогда ТекущееРабочееМесто = ЗаписиСостоянийСтроки.РабочееМесто; КонецЕсли;
					СписокСотрудников.Добавить(ЗаписиСостоянийСтроки.Сотрудник);				
				КонецЦикла;
				
				СтруктураЭлемента.Вставить("РабочееМесто", ТекущееРабочееМесто);
				СтруктураЭлемента.Вставить("СписокСотрудников", СписокСотрудников);
				
				СписокПериодов.Добавить(СтруктураЭлемента);
				
				ДатаНачалаРабот = Дата(1,1,1,0,0,1);
				
			КонецЕсли;
			
			Если СчитатьОкончательныеИтоги Тогда 
				Прервать;	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПакетРаботРаботы.ЗаказНаряд КАК ЗаказНаряд,
	               |	ПакетРаботРаботы.Работа,
	               |	СУММА(ЕСТЬNULL(ПакетРаботРаботы.Количество, 0) * ЕСТЬNULL(ПакетРаботРаботы.Коэффициент, 0)) КАК Норматив
	               |ИЗ
	               |	Документ.УРВ_ПакетРабот.Работы КАК ПакетРаботРаботы
	               |ГДЕ
	               |	ПакетРаботРаботы.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПакетРаботРаботы.ЗаказНаряд,
	               |	ПакетРаботРаботы.Работа";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	ТаблицаРабот = Запрос.Выполнить().Выгрузить();
	ВсегоНорматив = ТаблицаРабот.Итог("Норматив");
	
	ТаблицаЗаписей = Новый ТаблицаЗначений;
	ТаблицаЗаписей.Колонки.Добавить("ЗаказНаряд");
	ТаблицаЗаписей.Колонки.Добавить("РабочееМесто");
	ТаблицаЗаписей.Колонки.Добавить("Работа");
	ТаблицаЗаписей.Колонки.Добавить("Сотрудник");
	ТаблицаЗаписей.Колонки.Добавить("Время");
	
	Для Каждого ПериодРаботы Из СписокПериодов Цикл
		
		КоличествоСотрудников = ПериодРаботы.Значение.СписокСотрудников.Количество();
		Для Каждого Сотрудник Из ПериодРаботы.Значение.СписокСотрудников Цикл
			
			Для Каждого СтрокаРабот Из ТаблицаРабот Цикл
				НоваяЗапись = ТаблицаЗаписей.Добавить();
				НоваяЗапись.ЗаказНаряд = СтрокаРабот.ЗаказНаряд;
				НоваяЗапись.РабочееМесто = ПериодРаботы.Значение.РабочееМесто;
				НоваяЗапись.Работа = СтрокаРабот.Работа;
				НоваяЗапись.Сотрудник = Сотрудник.Значение;
				ДоляВОбщемНормативе = СтрокаРабот.Норматив/ВсегоНорматив;
				НоваяЗапись.Время  = Окр(ПериодРаботы.Значение.Время*ДоляВОбщемНормативе/КоличествоСотрудников);
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	ТаблицаЗаписей.Свернуть("ЗаказНаряд, РабочееМесто, Работа, Сотрудник", "Время");
	
	НаборЗаписейФактическоеВремяРабот = РегистрыСведений.УРВ_ФактическоеВремяРабот.СоздатьНаборЗаписей();
	НаборЗаписейФактическоеВремяРабот.Отбор.ПакетРабот.Установить(Ссылка);
	НаборЗаписейФактическоеВремяРабот.Прочитать();
	Если НаборЗаписейФактическоеВремяРабот.Количество() <> 0 Тогда
		НаборЗаписейФактическоеВремяРабот.Очистить();	
	КонецЕсли;
	
	Для Каждого СтрокаЗаписей Из ТаблицаЗаписей Цикл
		НоваяЗапись = НаборЗаписейФактическоеВремяРабот.Добавить();
		НоваяЗапись.ПакетРабот = Ссылка;
		НоваяЗапись.ЗаказНаряд = СтрокаЗаписей.ЗаказНаряд;
		НоваяЗапись.РабочееМесто = СтрокаЗаписей.РабочееМесто;
		НоваяЗапись.Работа = СтрокаЗаписей.Работа;
		НоваяЗапись.Сотрудник = СтрокаЗаписей.Сотрудник;
		НоваяЗапись.Время  = СтрокаЗаписей.Время;
	КонецЦикла;
	
	НаборЗаписейФактическоеВремяРабот.Записать();
	
	// выведем сообщения об ошибках и предупреждениях
	дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
	
КонецПроцедуры // ОбработкаПроведения


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли
